tests/productsartillery.yml
config:
  target: "https://localhost:8080/"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  payload:
    path: "../product.csv"
    fields:
      - "id"
scenarios:
  - name: "navigation"
    flow:
      - get:
          url: "/products"
      - get:
          url: "/products/{{ id }}"